function solution(n) {
    if(n === 1) return 1;
    else if(n === 2) return 2;
    
    let 경우의수배열 = [1, 2];
    const 나눌수 = 1234567;
    
    for(let i=2; i<n; i++) {
        경우의수배열.push((경우의수배열[i-1] + 경우의수배열[i-2]) % 나눌수);
    }
    
    return 경우의수배열[경우의수배열.length - 1];
}

/*
1 = [1]; 1
2 = [1, 1], [2]; 2
3 = [1, 1, 1], [1, 2], [2, 1]; 3
4 = [1, 1, 1, 1], [1, 2, 1], [2, 1, 1], [1, 1, 2], [2, 2]; 5;
5 = [1, 1, 1, 1, 1], [2, 1, 1, 1], [1, 2, 1, 1], [1, 1, 2, 1], [1, 1, ,1, 2], [2, 2, 1], [2, 1, 2]
    [1, 2, 2]; 8
    
    n = (n-1) + (n-2)
*/